In [1]:
import pandas as pd

### Intro to the Merging, Joining, and Concatenating Module

In [36]:
week1 = pd.read_csv('Restaurant - Week 1 Sales.csv')
week2 = pd.read_csv('Restaurant - Week 2 Sales.csv')
customers = pd.read_csv('Restaurant - Customers.csv')
foods = pd.read_csv('Restaurant - Foods.csv')

### The pd.contact() Method, Part 1

In [3]:
week1.head(3)

   Customer ID  Food ID
0          537        9
1           97        4
2          658        1

In [4]:
week2.head(2)

   Customer ID  Food ID
0          688       10
1          813        7

In [5]:
customers.head(2)

   ID First Name Last Name  Gender  Company                     Occupation
0   1     Joseph   Perkins    Male  Dynazzy  Community Outreach Specialist
1   2   Jennifer   Alvarez  Female     DabZ        Senior Quality Engineer

In [6]:
foods.head(2)

   Food ID Food Item  Price
0        1     Sushi   3.99
1        2   Burrito   9.99

### The pd.concat() Method, Part 1

In [ ]:
## .concat() function dorectly called on pandas library, and it takes two objects and it combines them into one
pd.concat()
## objs =  put a python list(2/3/4), ignore_index = False means the week1 dataframe will keep the index from two objects

In [9]:
## set two dataframes
pd.concat([week1, week2]).tail(2)  ## the number only shows 249 as index, but indeed we have 500 rows
## Week1 dataframe will be in front of week2

     Customer ID  Food ID
248          252        9
249          249        6

In [10]:
len(pd.concat([week1, week2]))

500

In [15]:
pd.concat([week1, week2], ignore_index = True).tail(2)

     Customer ID  Food ID
498          252        9
499          249        6

In [ ]:
## Remind that when concatenating dataframes, the column names should be identical

## The pd.concat() Method, Part 2

In [38]:
## Want to retain an identifier that tells which dataset is came from when combining different datasets.
## keys = None parameter in pd.concat() can be used to identify which dataframe values came from, input Python list
sales = pd.concat(objs = [week1, week2], keys = ['Week 1', 'Week 2'])
sales.head(3)
## This returns a multiIndex DataFrame

          Customer ID  Food ID
Week 1 0          537        9
       1           97        4
       2          658        1

In [39]:
sales.loc['Week 1'].head(3)

   Customer ID  Food ID
0          537        9
1           97        4
2          658        1

In [40]:
sales.loc[('Week 2', 240)]

Customer ID    734
Food ID          1
Name: (Week 2, 240), dtype: int64

In [41]:
sales.loc[('Week 2', 240), 'Customer ID']

734

### The .append() Method on a DataFrame

In [44]:
## .append() function is called on dataframe, append week1 to week2, week2 is in the front
week2.append(week1, ignore_index = True).head(3)  ## equivalent to pd.concat() function
## append rows of 'other' to the end of this frame, returning a new object

   Customer ID  Food ID
0          688       10
1          813        7
2          495       10

### Inner Joins, Part 1

In [ ]:
## Inner join merges two datasets based on commonly shared values

In [46]:
## the default in merge() function is inner join, on = parameter only works on when there are two identical columns(name)
week1.merge(week2, how = 'inner', on='Customer ID').head(4)
## Food ID_x is from week1 and Food ID_y is from week2

   Customer ID  Food ID_x  Food ID_y
0          537          9          5
1          155          9          3
2          155          1          3
3          503          5          8

In [50]:
## From the above output, there are two rows for the same Customer ID 155, the reason is that Customer 155 came twice in week1
week1[week1['Customer ID'] == 155]

    Customer ID  Food ID
4           155        9
17          155        1

In [49]:
week2[week2['Customer ID'] == 155]

     Customer ID  Food ID
208          155        3

In [51]:
## Change the column name after merging, suffixes = provide new names 
week1.merge(week2, how = 'inner', on = 'Customer ID', suffixes = [' - Week 1', ' - Week 2']).head(3)

   Customer ID  Food ID - Week 1  Food ID - Week 2
0          537                 9                 5
1          155                 9                 3
2          155                 1                 3

### Inner Joins, Part 2

In [53]:
## Inner Joins across multiple columns, customer come on week1 and week2 and also order the exact same food
week1.merge(week2, how = 'inner', on=['Customer ID', 'Food ID'])
## We found that Customer ID 21 appears twice for multiple columns inner join

   Customer ID  Food ID
0          304        3
1          540        3
2          937       10
3          233        3
4           21        4
5           21        4
6          922        1
7          578        5
8          578        5

In [4]:
week1[week1['Customer ID'] == 21]

     Customer ID  Food ID
101           21        4
212           21        4

In [5]:
week2[week2['Customer ID'] == 21]
## It is because Customer ID 21 order same food 4 twice in week1 and once in week2

    Customer ID  Food ID
30           21        4

### Outer Joins

In [ ]:
## outer joins which combine values that are found in either a dataframe or both
## The returns will be have the data from both dataframes, if there is not a match, NaN will be shown

In [3]:
week1.merge(week2, how = 'outer', on = 'Customer ID', suffixes = [' - Week 1', ' - Week 2'])

     Customer ID  Food ID - Week 1  Food ID - Week 2
0            537               9.0               5.0
1             97               4.0               NaN
2            658               1.0               NaN
3            202               2.0               NaN
4            155               9.0               3.0
5            155               1.0               3.0
6            213               8.0               NaN
7            600               1.0               NaN
8            503               5.0               8.0
9            503               5.0               9.0
10            71               3.0               NaN
11            71               8.0               NaN
12           174               3.0               NaN
13           961               9.0               NaN
14           966               5.0               NaN
15           641               4.0               NaN
16           288               2.0               NaN
17           149               4.0               NaN
18           954               2.0               NaN
19           147               9.0               NaN
20           147               8.0               NaN
21           550               6.0               7.0
22           101               7.0               4.0
23           549               6.0               NaN
24            75               6.0               4.0
25            78               7.0               NaN
26           514               5.0               NaN
27           833               7.0               NaN
28           833               3.0               NaN
29           329               8.0               NaN
..           ...               ...               ...
424          622               NaN               9.0
425          959               NaN               4.0
426          959               NaN               2.0
427          810               NaN               2.0
428          488               NaN               2.0
429          188               NaN               8.0
430          305               NaN               2.0
431          869               NaN               7.0
432          131               NaN               1.0
433          208               NaN               4.0
434          145               NaN               5.0
435          794               NaN               6.0
436          734               NaN              10.0
437          734               NaN               1.0
438          735               NaN               2.0
439          940               NaN               8.0
440          571               NaN               7.0
441          888               NaN               2.0
442          664               NaN               6.0
443          143               NaN               4.0
444          505               NaN               3.0
445           54               NaN               8.0
446          367               NaN               8.0
447          883               NaN               8.0
448          251               NaN               9.0
449          855               NaN               4.0
450          559               NaN              10.0
451          276               NaN               4.0
452          556               NaN              10.0
453          252               NaN               9.0

[454 rows x 3 columns]

In [8]:
## Another thing to do is to offer a visual indicator of where the value is being pulled from 
week1.merge(week2, how = 'outer', on='Customer ID', suffixes = [' - Week 1', ' - Week 2'], 
            indicator = True).head() ## last column
## indicator = True creates a column on the final column which tells where the data is pulled from,
## both means that the primary key was found in both dataframes, left_only/right_only means the primary key was found in one of the dataframes

   Customer ID  Food ID - Week 1  Food ID - Week 2     _merge
0          537               9.0               5.0       both
1           97               4.0               NaN  left_only
2          658               1.0               NaN  left_only
3          202               2.0               NaN  left_only
4          155               9.0               3.0       both

In [5]:
merged = week1.merge(week2, how = 'outer', on='Customer ID', suffixes = [' - Week 1', ' - Week 2'], indicator = True)
merged['_merge'].value_counts()  ## share 62 common on primary keys

right_only    197
left_only     195
both           62
Name: _merge, dtype: int64

In [7]:
## Extract the records that not match in both dataframes
merged[merged['_merge'].isin(['left_only', 'right_only'])].head(3)

   Customer ID  Food ID - Week 1  Food ID - Week 2     _merge
1           97               4.0               NaN  left_only
2          658               1.0               NaN  left_only
3          202               2.0               NaN  left_only

### Left Joins

In [11]:
## week1(main) dataframe left join with foods(additional information)
week1.merge(foods, how = 'left', on = 'Food ID', sort = True).head(3)
## sort = True will sort based on the primary key
## create a new dataframe, need to be reassigned

   Customer ID  Food ID Food Item  Price
0          658        1     Sushi   3.99
1          600        1     Sushi   3.99
2          155        1     Sushi   3.99

### The left_on and right_on Parameters

In [25]:
## The parameters in .merge() function that deal with different column names(primary keys)
## merge the week2 and customers dataset
week2.merge(customers, how = 'left', left_on = 'Customer ID', right_on = 'ID', sort = True).drop('ID', axis = 'columns').head(3)

,Customer ID,Food ID,First Name,Last Name,Gender,Company,Occupation
0,688,10,Carl,Williamson,Male,Thoughtmix,Graphic Designer
1,813,7,Johnny,Walker,Male,Kayveo,Developer II
2,495,10,Deborah,Little,Female,Babbleblab,VP Accounting

### Merging by Indexes with the left_index and right_index Parameters

In [26]:
## Merge dataframes on the common indexes
customers.set_index(keys = 'ID', inplace = True)
foods.set_index(keys = 'Food ID', inplace = True)

In [27]:
foods.head(2)

        Food Item  Price
Food ID
1           Sushi   3.99
2         Burrito   9.99

In [28]:
customers.head(2)

   First Name Last Name  Gender  Company                     Occupation
ID
1      Joseph   Perkins    Male  Dynazzy  Community Outreach Specialist
2    Jennifer   Alvarez  Female     DabZ        Senior Quality Engineer

In [31]:
## Now we want to merge foods and customers to the week data in chain, right_index/left_index must be fed in bool
sales = week1.merge(customers, how = 'left', left_on = 'Customer ID', right_index = True)
sales.head(3)  ## We do not have duplicated columns

,Customer ID,Food ID,First Name,Last Name,Gender,Company,Occupation
0,537,9,Cheryl,Carroll,Female,Zoombeat,Registered Nurse
1,97,4,Amanda,Watkins,Female,Ozu,Account Coordinator
2,658,1,Patrick,Webb,Male,Browsebug,Community Outreach Specialist

In [33]:
sales = sales.merge(foods, how = 'left', left_on = 'Food ID', right_index = True)
sales.head(3)

,Customer ID,Food ID,First Name,Last Name,Gender,Company,Occupation,Food Item,Price
0,537,9,Cheryl,Carroll,Female,Zoombeat,Registered Nurse,Donut,0.99
1,97,4,Amanda,Watkins,Female,Ozu,Account Coordinator,Quesadilla,4.25
2,658,1,Patrick,Webb,Male,Browsebug,Community Outreach Specialist,Sushi,3.99

In [35]:
week1.merge(week2, how = 'left', left_index = True, right_index = True, suffixes = [' - Week 1', ' - Week 2']).head(3)

   Customer ID_x  Food ID_x  Customer ID_y  Food ID_y
0            537          9            688         10
1             97          4            813          7
2            658          1            495         10

### The .join() Method

In [38]:
satisfaction = pd.read_csv('Restaurant - Week 1 Satisfaction.csv')   ## 250 rows for each record in week1 dataset
satisfaction.head(3)

   Satisfaction Rating
0                    2
1                    7
2                    3

In [40]:
week1.merge(satistifaction, how = 'left', right_index = True, left_index = True).head(3)  
## This is one  method to join these two dataframes by using the same indexes of both

   Customer ID  Food ID  Satisfaction Rating
0          537        9                    2
1           97        4                    7
2          658        1                    3

In [41]:
## Another way is to use .join() function when join by indexes of both dataframes
week1.join(satisfaction).head(3)
## The .join() function cna be helpful as a shortcut when needs join very quickly

   Customer ID  Food ID  Satisfaction Rating
0          537        9                    2
1           97        4                    7
2          658        1                    3

### The pd.merge() Method

In [43]:
## Use merge method directly on pandas
pd.merge(week1, customers, how = 'left', left_on = 'Customer ID', right_on = 'ID').head()

,Customer ID,Food ID,ID,First Name,Last Name,Gender,Company,Occupation
0,537,9,537,Cheryl,Carroll,Female,Zoombeat,Registered Nurse
1,97,4,97,Amanda,Watkins,Female,Ozu,Account Coordinator
2,658,1,658,Patrick,Webb,Male,Browsebug,Community Outreach Specialist
3,202,2,202,Louis,Campbell,Male,Rhynoodle,Account Representative III
4,155,9,155,Carolyn,Diaz,Female,Gigazoom,Database Administrator III